request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="myNameSpace">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCountryRequest>
         <gs:name>Spain</gs:name>
         <gs:id>SPA</gs:id>
      </gs:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>
